{
  "backend/main.mo": "Main Motoko actor implementing the Tribes Of Rudra backend with profile CRUD, post/reply creation, and access-controlled APIs using authorization and blob-storage mixins.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs to their affected files, component dependencies, test IDs, and confidence levels for the Tribes Of Rudra rebrand and redesign.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file, serving as a quick reference for the purpose and theming of every component and page.",
  "frontend/index.css": "Global Tailwind CSS base layer defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point with the page title set to 'Tribes Of Rudra' and a spiritual meta description for the Hindu community platform.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with routes for feed, discover, and profile pages, wrapping them in a layout with NavBar, Footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/CreatePostForm.tsx": "Post creation form with a spiritual placeholder text, Ctrl+Enter shortcut, and a 'Share' button that calls the createPost mutation and shows devotional toast feedback.",
  "frontend/src/components/Footer.tsx": "Footer component branded as 'Tribes Of Rudra' with the emblem logo, Sanskrit tagline, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/InterestTag.tsx": "Reusable pill component for displaying or selecting interest tags, with selectable/selected state styling using saffron/accent color tokens and smooth scale transitions.",
  "frontend/src/components/NavBar.tsx": "Sticky navigation bar with logo, nav links (Feed, Discover, Profile), and login/logout controls using Internet Identity. Supports both desktop and mobile (hamburger menu) layouts.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author name, timestamp, content, and a collapsible replies section. Authenticated users can submit replies via the embedded ReplyForm.",
  "frontend/src/components/ProfileCard.tsx": "Renders a compact user profile card with avatar, display name, join date, bio, and up to 4 interest tags, linking to the full profile page.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time profile creation, collecting display name, bio, and spiritual interests, then calling the createProfile mutation and navigating to the feed.",
  "frontend/src/components/ReplyForm.tsx": "Small form component for submitting a text reply to a post, using the useAddReply mutation and showing toast notifications on success or failure.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage AuthClient lifecycle, identity persistence, and login/logout state for Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profile and post operations (fetch, create, update) and a discovery query to find profiles by interests, all using the ICP actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind, and defines a saffron/gold/indigo design token palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/DiscoverPage.tsx": "Page that lets authenticated users filter and discover other devotee profiles by selecting spiritual interest tags, with an auth gate for unauthenticated users.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page featuring a hero banner, spiritual pillars section, post creation form, and a list of all posts, with login prompt for unauthenticated users.",
  "frontend/src/pages/ProfilePage.tsx": "Profile detail page that displays a user's avatar, bio, interests, join date, and their posts, with skeleton loading states and a not-found fallback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom fonts (Plus Jakarta Sans, Cinzel), an oklch-based color palette, extended border radii, box shadows, and animation keyframes using typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Project state manifest for 'Tribes Of Rudra', a spiritually-focused Hindu community web app, capturing schema version, architectural notes, existing feature list with requirement IDs, known issues, and image asset requirements."
}